var local_database = [{
    date: "July 31 2018",
    title: "正是虾肥蟹壮时",
    imgSrc: "/images/post/crab.png",
    avatar: "/images/avatar/1.png",
    content: "我们常说的大闸蟹，双螯处有如墨绒毛团，其余六爪呈金黄色，腿毛稀疏，挺拔有力，配上曲爪弯钩，看起来攻击力十足。其实蟹是否好吃，分辨起来甚是简单。好的大闸蟹养殖区，选择在水库上游敞水区域或者河流入水口的两侧一带，因为这一区域避开了主河道，水域开阔、水质良好没污染。",
    collection: "86",
    reading: "98",
    headImgSrc: "/images/post/crab.png",
    author: "小马",
    dateTime: "8小时前",
  detail: "“螃蟹”是个抽象的生物学概念，一个认真的吃货眼里没有螃蟹，只有大闸蟹、小毛蟹、青蟹、花蟹、梭子蟹、面包蟹、帝王蟹……在国内，大闸蟹的受欢迎之广泛程度，恐怕要冠绝蟹界。长江中下游乡间成长起来的男孩子，想必都有这样的记忆：时逢秋季，潦水尽而寒潭清，夕阳西下，秋风萧索，沟渠半干。折根枝条在手上，看到沟渠底横卧的大螃蟹，就将枝条轻悄悄递至大螯旁，勾引它夹住，夹住便再不松口，轻易就将这货钓上来。一路走一路钓，是童年的金秋。只是这种螃蟹味道一般，腿上也没有毛，多半是汪曾祺所说的“彭蜞”。虽只是名称不同，但却有类似“黄口小儿”般的贬义。我们常说的大闸蟹，双螯处有如墨绒毛团，其余六爪呈金黄色，腿毛稀疏，挺拔有力，配上曲爪弯钩，看起来攻击力十足。市场上，人们多半是分不清湖蟹、河蟹、塘蟹的，而养殖者多各执一词。其实蟹是否好吃，分辨起来甚是简单：看水质。好的大闸蟹养殖区，选择在水库上游敞水区或河流入水库水口的两侧一带，因为这一区域避开了主河道，水域开阔、水质良好没污染。捕蟹者，在港湾间设置闸门，闸用竹片编成，夜间挂上灯火，蟹见光亮，即循光爬上竹闸，此时只需在闸上一一捕捉，故叫大闸蟹。",
    postId: 0,
    music: {
      dataUrl: 'http://ws.stream.qqmusic.qq.com/C100000QCwge3B6Ad1.m4a?fromtag=0&guid=126548448',
      title: '肆无忌惮-薛之谦',
      coverImgUrl: 'https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1534016511147&di=1e57c7ba5a22cd495950396549daf04c&imgtype=0&src=http%3A%2F%2Fwww.guangyuanol.cn%2Fuploads%2Fallimg%2F180517%2F1513343451-1.jpg'
    }
  },
  {
    date: "Aug 28 2018",
    title: "比利·林恩的中场战事",
    imgSrc: "/images/post/bl.png",
    avatar: "/images/avatar/2.png",
    content: "伊拉克战争时期，来自美国德州的19岁技术兵比利·林恩（乔·阿尔文 Joe Alwyn 饰）因为一段偶然拍摄的视频而家喻户晓。那是一次规模不大却激烈非常的遭遇战，战斗中林恩所在的B班班长（范·迪塞尔 Vin Diesel 饰）遭到当地武装分子的伏击和劫持，而林恩为了营救班长不惜铤而走险冲锋陷阵。",
    collection: "79",
    reading: "83",
    headImgSrc: "/images/post/bl.png",
    author: "小猪",
    dateTime: "两天前",
    detail: "　伊拉克战争时期，来自美国德州的19岁技术兵比利·林恩（乔·阿尔文 Joe Alwyn 饰）因为一段偶然拍摄的视频而家喻户晓。那是一次规模不大却激烈非常的遭遇战，战斗中林恩所在的B班班长（范·迪塞尔 Vin Diesel 饰）遭到当地武装分子的伏击和劫持，而林恩为了营救班长不惜铤而走险冲锋陷阵。视频公布于世让他成为全美民众所崇拜的英雄，然而却鲜有人理解他和战友们所经历的一切。为了安葬班长，B班得到了短暂的休假，因此他们得以受邀参加一场在德州举行的橄榄球比赛。林恩的姐姐因某事件深感愧疚，她希望弟弟能借此机缘回归普通生活。而周围的经纪人、球迷、大老板、普通民众则对战争、卫国、士兵有着各种各样想当然的理解。球场上的庆典盛大开幕，林恩和战友们的心却愈加沉重与焦躁…… ",
    postId: 1,
    music: {
      dataUrl: 'http://dl.stream.qqmusic.qq.com/C400000ZaiyI438ImW.m4a?vkey=EC10C1A15084729643123B8D96A3237E73DEFD7106B501A2D3628B7F0C6C7D0A375A4E9FE5DF1C2484A33449909A0C5DCF1EB8BD02CDA698&guid=6906896097&uin=203863662&fromtag=66',
      title: '24／7(《喜剧之王》电影插曲)-日向大介',
      coverImgUrl: 'https://y.gtimg.cn/music/photo_new/T002R300x300M000000eVOLz35903t.jpg?max_age=2592000'
    }
  },
  {
    date: "Aug 28 2018",
    title: "日本高中生用VR还原广岛原子弹事件",
    imgSrc: "/images/post/vr.png",
    avatar: "/images/avatar/2.png",
    content: "1945年，美军向日本广岛、长崎投了原子弹，整个天空都被黑暗笼罩，建筑物被夷为平地，造成大量平民和军人伤亡。为了铭记这段历史，日本学生利用VR还原了广岛遭受原子弹轰炸前后的场景，画面十分震撼。历时两年，这款体验最终完成。通过将用户传送至广岛瞬间变成废墟的那个时刻，感受当时人们内心的慌乱与恐惧。",
    collection: "29",
    reading: "56",
    headImgSrc: "/images/post/vr.png",
    author: "大猫",
    dateTime: "三天前",
    detail: "1945年，美军向日本广岛、长崎投了原子弹，整个天空都被黑暗笼罩，建筑物被夷为平地，造成大量平民和军人伤亡。为了铭记这段历史，日本学生利用VR还原了广岛遭受原子弹轰炸前后的场景，画面十分震撼。一群日本高中生一直致力于制作一款旨在73年前搞到遭遇原子弹袭击情景的VR体验。终于，历时两年，这款体验最终完成。通过将用户传送至广岛瞬间变成废墟的那个时刻，感受当时人们内心的慌乱与恐惧。体验时长5分钟，用户既可以体验到广岛被轰炸前的繁荣景象，回溯这里曾经屹立的建筑和繁荣的商业，也可以感受其被轰炸后，片刻之间，整座城市瞬间成为一片废墟，大楼夷为一片平地，无数人受伤乃至丧生。两种画面形成的鲜明反差令人震撼，引人深省。这群学生及其老师希望借此体验呼吁世界和平，以避免未来再次发生这样的事情。同时希望，日本民众能够铭记这段历史，记住这一惨痛的教训。",
    postId: 2,
    music: {
      dataUrl: 'http://dl.stream.qqmusic.qq.com/C400000NKpE60tnMfQ.m4a?vkey=2FBDCAEC0E4B7BEE6C5E8585C690E2E0DCD18C5FFB853E9233AD9FA39A5ACB419088DDAEA27794C63AF83512D252401B05A04FBED0FDC09C&guid=6906896097&uin=203863662&fromtag=66',
      title: 'Juste une photo de toi - Matt Pokora',
      coverImgUrl: 'https://y.gtimg.cn/music/photo_new/T002R300x300M000001WqDOT1GiHtU.jpg?max_age=2592000'
    }
  },
  {
    date: "Aug 28 2018",
    title: "青蛙旅行家",
    imgSrc: "/images/post/sls.jpg",
    avatar: "/images/avatar/2.png",
    content: "有一只青蛙，每天捕捉蚊子和昆虫，和朋友们一起呱呱地叫，生活得很快乐。一天，飞来一群野鸭，青蛙马上躲到水底下去。“他们要到哪儿去呢?”青蛙又把头探 出水面。只听一只野鸭说：“天冷了，我们飞到南方去吧，那儿暖和，还有吃不完的小虫。 ",
    collection: "79",
    reading: "83",
    headImgSrc: "/images/post/sls.jpg",
    author: "卟咚",
    dateTime: "一周前",
    detail: "有一只青蛙，每天捕捉蚊子和昆虫，和朋友们一起呱呱地叫，生活得很快乐。 一天，飞来一群野鸭，青蛙呢?”青蛙又把头探 出水面。只听一只野鸭说：“天冷了，我们飞到南方去吧，那儿暖和，还有吃不完的小虫。 ” “呱!”青蛙忍不住叫起来，“请把我也带到南方去吧!”“真稀奇，”野鸭们围住他喊 道，“你没翅膀，我们怎么带你呢 ?”“让我想一想。”青蛙说完跳进水里。不一会儿，他 露出头来说：“我想出来了。你们两只鸭子嘴里叼一根树枝，我咬住中间，你们一飞，我也 就飞起来了。只要你们不‘呷呷’地叫，我也不‘呱呱’地喊，就行。”野鸭们按照青蛙的主意，带他飞上了高空。青蛙很快就习惯了这种飞行，他一边东张西 望，一边得意地想：我出的主意多妙啊!野鸭们带着青蛙飞过田野、草原、河流和山峦。后 来，他们来到收割完庄稼、堆满粮食垛的村庄上空。村子里的人们看到鸭群里有个奇怪的东西，都用手指点着。青蛙很想听听人们怎样夸奖 他。休息时，他请求野鸭们飞得低一点。第二天，他们飞得很低，可以听见人说话的声音。“看哪!”村子里的人们大声说，“ 野鸭子抬着青蛙飞!”“谁这么聪明，想出这么好的主意 ?”青蛙再也憋不住了，忘记了不能 张嘴。他拼命叫喊：“是我!我!”随着喊声，他头朝下栽落下去。还好，“扑通”一声，青蛙掉进了村边的水塘里。",
    postId: 3,
    music: {
      dataUrl: 'http://dl.stream.qqmusic.qq.com/C4000039C7wd35MoPY.m4a?vkey=70011AEF51B4BC6C5760F73E9E7287FC9486B9A0717829C7746DDF2791343B7FDF578983B2CAA0FF155A67F4E0D2196A37A2D6B09DAC0494&guid=6906896097&uin=203863662&fromtag=66',
      title: '曾经心痛-卢靖姗',
      coverImgUrl: 'https://y.gtimg.cn/music/photo_new/T001R300x300M000001r3SD1299Cbh.jpg?max_age=2592000'
    }
  },
  {
    date: "Aug 28 2018",
    title: "小程序争霸赛？李彦宏向张小龙开战！",
    imgSrc: "/images/post/xiaolong.jpg",
    avatar: "/images/avatar/2.png",
    content: "提到小程序，我们想到的肯定是微信小程序，但是你可知道百度的智能小程序已经开始亮相了？并且，百度智能小程序将不同于微信的内置小程序，而是形成一个生态链。这个生态链将包括新浪、网易等互联网巨头产品的嵌入。号称未来要以小程序称霸的马化腾，这次遭遇了一个强劲的对手？",
    collection: "79",
    reading: "83",
    headImgSrc: "/images/post/xiaolong.jpg",
    author: "大熊",
    dateTime: "一年前",
    detail: "7月5日，在2018百度AI开发者大会智能小程序分论坛上，百度副总裁沈抖和百度App业务部总经理平晓黎重点介绍了百度智能小程序的战略价值以及与微信小程序的区别。据百度方面介绍，与其他小程序平台不同，智能小程序是主动、持续的分发。百度智能小程序不仅会在信息流中进行分发，也会在内容相近的百家号文章中、文章的底部等处进行分发。此外自然搜索结果和阿拉丁也都是智能小程序的入口。可分发、可沉淀、可经营优势，将帮助开发者获得超越同业的流量支持，所有的优质智能小程序都可以平等地脱颖而出。沈抖强调，智能小程序是百度AI落地和重构移动生态的重要产品，将给开发者一个重新找回流量、服务用户的新途径。他同时表示，智能小程序是开放的生态，不仅可以运行于百度的平台，更可以运行于外部App上，开发者一次开发就可以实现多端运行，这和微信小程的封闭生态有着本质的区别。",
    postId: 4,
    music: {
      dataUrl: 'http://dl.stream.qqmusic.qq.com/C40000482T2v3IcLE5.m4a?vkey=DC4078C7F2BD9EA78B7880852C34498AF46E877E1EC0B69794E375FBC5350937EA1F31187C2B4EE9A5104E37E4503A978418C4B8A6053C18&guid=6906896097&uin=203863662&fromtag=66',
      title: '道-黄霑',
      coverImgUrl: 'https://y.gtimg.cn/music/photo_new/T002R300x300M000004f6b7p0n5Zdl.jpg?max_age=2592000'
    }
  }
]

module.exports = {
  postList: local_database
}

//按住alt+shift+f 可以格式化代码
//本文件可以理解为一个本地的数据库